package ru.geekbrains.level1.homework2;

public class Lesson {

    public static void main(String[] args) {
        System.out.println("Hello Java!");
    }
}

Желтые буквы это путь там где ты сейчас находишься
в голубых скобках это имя ВЕТКИ branch
Веток может быть много
Это делается для того, чтобы в своих ветках работали разные программисты над одним и тем же проектом
Пока не заморачивайся с этим..
дальше последовательно пиши в гитбаш комманды

git add .
git commit -m 'ТВОЕ СООБЩЕНИЕ ЛЮБОЙ ТЕКСТ В ОДИНОЧНЫХ КАВЫЧККАХ'
git push

поехали
3
2
1
старт )
круто но нихера не понятно

это НОРМАЛЬНО!
у всех так без исключения
пиши команды я смотрю
я вообще не понял что отменя хочешь щас)
вот три команды я выше написал
их по очереди пиши в консоли
сначала первую
        git add .
пиши руками
так лучше запоминаешь
провереноgit